{
  "common": {
    "Mt1": "¡WELCOME!",
    "Mt2": "I'm",
    "Mt3": "Front-end developer",
    "Mp": "I'm passionate about building functional and engaging web experiences. My approach is to find creative solutions through front-end development",
    "At": "About me",
    "At2": "Who I am",
    "Ap1": "I'm a developer with a focus on Front-End, also adquiering Back-End experience through a personal project. I specialize in develpoing interfaces using HTML, various CSS and JavaScript frameworks, and tools like Figma to efficiently layout web designs. I enjoy mastering new languages and technologies, I always seek to learn and plan the most efficent solution.",
    "Ap2": "My journey in the Front-end world began in 2021, when I decided to quit my job in telecommunications to pursue web development. Through a JavaScript course, I gained a solid foundation in web development, culminating in an exciting project: an E-Wallet based on React.js and Web3.js. Since then, I have been expanding my knowledge and I am currently working on a personal project, still in development, where I combine my Front-End and Back-End skills to create an innovative solution.",
    "Asubt": "Take a close look at my most recent projects",
    "St1": "Skills",
    "St2": "Signature Skills",
    "Pt1": "Projects",
    "Pt2": "What I've built",
    "Pproject1T": "Eth-Wallet",
    "Pproject1Subt": "ReactJS, Web3.JS",
    "Pproject2T": "Real-State Page",
    "Pproject2Subt": "MERN Stack",
    "PprojectB": "More Info",
    "PprojectB2": "Under Development",
    "Ct1": "Contact",
    "Ct2": "Let's connect",

    "Csubt": "Front-End Developer",
    "Cp1": "I'm available for freelance jobs and full-time positions. Contact me and let's chat!",
    "Cp2": "Let me know your ideas",

    "Cl1": "Name",
    "Cl2": "Phone",
    "Cl3": "Email",
    "Cl4": "Subject",
    "Cl5": "Message",
    "Cb": "Send menssage",
    "Nt1": "About me",
    "Nt2": "Skills",
    "Nt3": "Projects",
    "Nt4": "Resume",
    "Nt5": "Contact",
    "Nsubt": "Let's build together",
    "Nsubt2": "Contact me"
  },
  "resume": {
    "t1": "Resume",
    "p1": "Web Development",
    "s1": "Web Design",
    "s2": "Bilingual",
    "p2": "Versatile, innovative and organized web developer with a high sense of responsibility and adaptation to different work environments in search of new challenges. Varied knowledge of front-end, basic back-end and digital marketing. Organization skills through Notion and team collaboration.",
    "s3": "Skills",
    "s4": "Technical Skills",
    "s5": "Front-End Web Developer",
    "s6": "Office Package",
    "s7": "Languages",
    "s8": "Advanced English con First Certificate",
    "s9": "Native Spanish",
    "subT1": "Personal Experience",
    "p3": "Final project development E-Wallet",
    "l1": "Build process of a e-wallet with React that uses Metamask to sign transactions, Ganache as blockchain, a simulated ERC20 token as currency, Truffle as compiler for contracts and Babel for translating react (since '.js' files were used)",
    "l2": "Creation of an ERC20 token with changed decimals",
    "subT2": "Other Professional Experience",
    "p4": "Telecomunications Technician",
    "l3": "Calibration and repairing of active and passive devices of Telecentro."
  },
  "wallet": {
    "p1": "Project",
    "t2": "General Description",
    "p2": "This app was created with React, it uses Metamask to sign transactions, Ganache as blockchain, Truffle as compiler for contracts and Babel for translating react (since '.js' files were used). The wallet allows you to make and receive transactions of an ERC20 token which I built, called USDTM (USDT Mock)  a token that has the same decimals as the USDT.",
    "b": "Code",
    "p3": "Tech",
    "p4": "Back"
  }
}
