{
  "common": {
    "Mt1": "¡BIENVENIDO!",
    "Mt2": "Soy",
    "Mt3": "Desarrollador web front-end",
    "Mp": "Me apasiona construir experiencias web cautivadoras y funcionales. Mi enfoque se centra en encontrar soluciones creativas a través del desarrollo front-end.",
    "At": "Sobre mi",
    "At2": "Quien soy",
    "Ap1": "Soy un desarrollador con un enfoque principal en Front-End, adquiriendo experiencia en Back-End a través de un proyecto personal. Mi especialidad es el desarrollo de interfaces utilizando HTML, diversos frameworks de CSS y JavaScript, y herramientas como Figma para realizar el maquetado de diseños web de manera eficiente. Disfruto dominar nuevos lenguajes y tecnologias, siempre busco aprender y planificar la solución más eficiente",
    "Ap2": "Mi viaje en el Front-End comenzó en 2021, cuando decidí dejar mi trabajo en telecomunicaciones para dedicarme al desarrollo web. A través de un curso de JavaScript, adquirí una sólida base en desarrollo web y culminé con un proyecto final emocionante: una E-Wallet basada en React.js y Web3.js. Desde entonces, he estado expandiendo mis conocimientos y actualmente trabajo en un proyecto personal, en desarrollo, donde combino mis habilidades en Front-End y Back-End para crear soluciones innovadoras.",
    "Asubt": "Observa de cerca mis proyectos más recientes",
    "St1": "Habilidades",
    "St2": "Dominio destacado",
    "Pt1": "Projectos",
    "Pt2": "Lo que construí",
    "Pproject1T": "Eth-Wallet",
    "Pproject1Subt": "ReactJS, Web3.JS",
    "Pproject2T": "Pagina Inmobiliaria",
    "Pproject2Subt": "MERN Stack",
    "PprojectB": "Mas Info",
    "PprojectB2": "En Desarrollo",
    "Ct1": "Contacto",
    "Ct2": "Conectemos",

    "Csubt": "Desarrollador Front-End",
    "Cp1": "Estoy disponible para trabajos freelance y posiciones full-time ¡Contáctame y charlemos!",
    "Cp2": "Hazme saber tus ideas",

    "Cl1": "Nombre",
    "Cl2": "Telefono",
    "Cl3": "Correo Electronico",
    "Cl4": "Asunto",
    "Cl5": "Mensaje",
    "Cb": "Enviar mensaje",
    "Nt1": "Sobre mi",
    "Nt2": "Habilidades",
    "Nt3": "Projectos",
    "Nt4": "Curriculum",
    "Nt5": "Contacto",
    "Nsubt": "Construyamos juntos",
    "Nsubt2": "Hablemos"
  },
  "resume": {
    "t1": "Curriculum",
    "p1": "Diseño Web",
    "s1": "Desarrollo Web",
    "s2": "Bilingüe",
    "p2": "Versatil, innovador y organizado desarrollador web con alto sentido de responsabilidad y adaptamiento a distintos ambientes de trabajo en busca de nuevos desafios. Variados conocimientos de front-end, back-end basico y marketing digital. Habilidades de organizamiento a traves de Notion y colaboración en equipo.",
    "s3": "Habilidades",
    "s4": "Habilidades Técnicas",
    "s5": "Desarrollador Web Front-End",
    "s6": "Paquete Office",
    "s7": "Idiomas",
    "s8": "Ingles avanzado con First Certificate",
    "s9": "Español Nativo",
    "subT1": "Experiencia Personal",
    "p3": "Desarrollo de Proyecto final E-Wallet",
    "l1": "Creación de una billetera con React que utiliza Metamask para firmar transacciones, Ganache como blockchain, un token ERC20 simulado como moneda, Truffle como compilador para los contratos y Babel por traducir react (ya que se usaron archivos )",
    "l2": "Creación de un token ERC20 con cambio de decimales.",
    "subT2": "Otras Experiencias Profesionales",
    "p4": "Tecnico de Telecomunicaciones",
    "l3": "Calibración y reparación de dispositivos activos y pasivos de la empresa Telecentro."
  },
  "wallet": {
    "p1": "Projecto",
    "t2": "Descripción General",
    "p2": "Esta app fue creada con React, utiliza Metamask para firmar transacciones, Ganache como blockchain, Truffle como compilador para los contratos y Babel por traducir react (ya que se usaron archivos .js). La billetera permite hacer y recibir transacciones de un token ERC20 el cual construi, llamado USDTM (USDT Mock) que posee los mismos decimales que el USDT.",
    "b": "Codigo",
    "p3": "Tecnologias",
    "p4": "Atras"
  }
}
